I am attaching the plan and apply output and also screen shot of my svc account access privileges of both Org and Project level. 
 I am outputting the service account being used to create the project to verify i am using the right svc  account. Project successfully created with no issues.

Please cross verify it again with my settings with yours. Also can you verify that by changing the org level permission to `Billing Administrator` produce any different results for you ? 

```
# google_project.demo_project will be created
  + resource "google_project" "demo_project" {
      + auto_create_network = true
      + billing_account     = "xxx-xxx-xxx"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "testing-project"
      + number              = (known after apply)
      + org_id              = "xxxxxx"
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.id: Creating...
random_id.id: Creation complete after 0s [id=stJV]
google_project.demo_project: Creating...
google_project.demo_project: Creation complete after 9s [id=projects/test-demo-project-v11719253]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

user_id = venky-service-account-limited@venky-external-org.iam.gserviceaccount.com
```
![Screenshot from 2020-02-25 15-41-02](https://user-images.githubusercontent.com/16162214/75297964-0ec35b80-57e6-11ea-8629-98feddcef955.png)
![Screenshot from 2020-02-25 15-40-21](https://user-images.githubusercontent.com/16162214/75297965-0f5bf200-57e6-11ea-9c2e-2e091b8f094f.png)
